[
  {
    "path": "posts/2025-09-24-module-5-assignment/",
    "title": "Module 5: Create Your Own Visualizations assignment Plotly vs. Datawrapper",
    "description": "My interactive visualization that captures the design elements I learned.",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2025-09-24",
    "categories": [],
    "contents": "\r\nOpen the dataset and explore the two columns: Average Position and Time.\r\nI used the Module # 5.xlsx file provided in the instructions and opened it in Microsoft Excel to view the data, including the average position and time columns.\r\nUse Plot.ly to:\r\nCreate at least one Ranking Chart (e.g., ordered bar chart, slope chart).\r\nI have successfully published my finished visualization on Plot.ly\r\nHere is a direct link to my Tableau visualization.\r\nhttps://chart-studio.plotly.com/~skylarwalsh/1/\r\nHere is an image:\r\n\r\nAt least one Part-to-Whole Chart (e.g., pie chart, stacked bar chart, donut chart).\r\nI have successfully published my finished visualization on Plot.ly\r\nHere is a direct link to my Tableau visualization.\r\nhttps://chart-studio.plotly.com/~skylarwalsh/3/\r\nHere is an image:\r\n\r\nThink about how these two design frameworks (Ranking and Part-to-Whole) reveal insights in your data.\r\nThe first visualization is a stacked bar chart that uses a ranking design framework to show how average position changes across 20 observations. Each bar is split into two different legend colors: orange, which is time, and blue, which represents average position. By stacking them, the chart makes it easy to compare the role of time progression against the variation in average position. The Ranking design of the bar chart is showing a sequential order. Each bar builds on the previous one, reinforcing the idea or concept of progression and cumulative growth.\r\nThe second visualization is a pie chart that uses a part-to-whole design framework to reveal insight about the data through Average Position by Time. The entire circle represents the complete dataset, which includes all observations and their average positions. Each slice represents the influence of a Time label, an Average Position value, and a Time percentage. By looking at the size of each slice, I can easily see which values had a larger or smaller share of the overall average positions.\r\nBlog Post Instructions:\r\nPost your visualizations on your blog.\r\nWrite a short description that includes:\r\nWhy you chose this dataset\r\nThe story or insights your visualizations tell.\r\nA quick reflection: What are the strengths and limitations of Part-to-Whole as a design framework?\r\nI selected the Module # 5.xlsx dataset for the Ranking visualization because it was easily accessible on the Canvas assignment page. For the Ranking design framework, a stacked bar chart is used because it allows the viewer to compare values across ordered observations while also clearly showing the progression along the ranked sequence of twenty observations. For the story and insight that it tells, the visualization shows that both time and average position increase steadily over 20 observations, with the blue piece (Average Position) stacked on top of the orange piece (Time). This makes it clear that average position improves consistently as time moves forward. The strengths of Ranking as a design framework are that it makes sequential order and progression easy to interpret and analyze, and it is effective for showing growth patterns. The limitations of Ranking as a design framework are that exact values may be harder to read compared to line charts and scatterplots, and proportions can be misinterpreted if two colors stacked on one bar share the same size in common.\r\nI selected the Module # 5.xlsx dataset for the Part-to-Whole visualization because it was easily accessible on the Canvas assignment page. For the Ranking design framework, a pie chart is used because it effectively shows how each time interval contributes to the overall average position dataset. For the story and insight that it tells, the visualization shows that some time intervals account for a larger portion of the overall average position, while others are influenced by only a small fraction. This provides insight into the distribution of average positions across time, showing which periods were most influential in having a certain effect on the total outcome. The strengths of Part-to-Whole as a design framework are that it clearly communicates proportions and it is easy to see both the balance and imbalance in the data. The limitations of Part-to-Whole as a design framework are that it is difficult to see the smallest slices on the chart and it is not as effective for showing trends or changes over time as I thought it would.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2025-09-24T12:20:33-04:00",
    "input_file": "module-5-assignment.knit.md"
  },
  {
    "path": "posts/2025-09-19-module-4-assignment/",
    "title": "Module 4: Time Series Visualization with Tableau Public",
    "description": "My time series visualization using Tableau Public.",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2025-09-19",
    "categories": [],
    "contents": "\r\nDownload the Dataset\r\nI used the Monthly Modal Time Series dataset that contained 12 variables\r\nPrepare Your Data\r\nAfter opening the dataset and reviewing the provided variables, I selected at least six variables: Year, Month, Vehicle Revenue Miles, Vehicle Revenue Hours, Total Security Events, and Total Injuries.\r\nCreate Your Visualization\r\nI uploaded my clean dataset to Tableau Public and designed a time series visualization.\r\nShare You Work\r\nI have successfully published my finished visualization on Tableau Public.\r\nHere is a direct link to my Tableau visualization.\r\nhttps://public.tableau.com/views/Time_Series_Visualization/Sheet1?:language=en-US&publish=yes&:sid=&:redirect=auth&:display_count=n&:origin=viz_share_link\r\nHere is an image:\r\n\r\nThe six variables I selected are: Year, Month, Vehicle Revenue Miles, Vehicle Revenue Hours, Total Security Events, and Total Injuries. I chose the year and month variables because I can use them as time series data points to analyze trends. I chose vehicle revenue hours and vehicle revenue miles variables to measure the total time vehicles are in service and the total distance traveled by all vehicles when they are in service. Finally, I chose total security events and total injuries variables to track patterns in security-related incidents over time and analyze the total number of injuries over time.\r\nThe time series visualization I created shows an inverse relationship between the total number of security events and the total number of injuries over time. Specifically, as the total security events with an orange color legend show an increasing trend, the total injuries in a blue color legend display a decreasing trend. This suggests that a higher frequency of security events is associated with a decline in injuries. However, it is worth noting that there is a possible inaccuracy in the exact lines, mainly for the year 2025, which has an incomplete data point. Therefore, while there is a strong connection between security measures and injury prevention, the final year should be viewed with caution, as it is still a misleading figure in the data. The actual lines show that as the total number of injuries increases, so does the total number of security events. The exact lines are completely accurate because it is always important to take proper security measures in the case of an injury or to prevent injury.\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4317-Visual-Analytics-Blog/blob/main/_posts/2025-09-19-module-4-assignment/Mod4.png?raw=true",
    "last_modified": "2025-09-19T12:01:36-04:00",
    "input_file": "module-4-assignment.knit.md"
  },
  {
    "path": "posts/2025-09-08-module-3-assignment/",
    "title": "Module 3: Refined Map with Color",
    "description": "My Geographic Map with the use of Adobe Illustrator and color principles.",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2025-09-08",
    "categories": [],
    "contents": "\r\nSet Up Your Illustrator Canvas\r\nI opened Adobe Illustrator and created a new file, and set an appropriate ratio.\r\nImport Your Data Graphic\r\nI opened my Module 2 map file in Illustrator, and then positioned and scaled it to fit the artboard.\r\nConvert to Vector & Apply Color\r\nI was able to vectorize the map image I placed, ungrouped the traced elements, used the Swatches panel to apply a thoughtful color palette, and then edited my vector elements.\r\nEnhance with Labels & Legends\r\nI used the Type tool to add clear labels, created a legend that explains my color scale and symbols, and applied Gestalt principles.\r\nExport & Publish\r\nI saved my file, exported it as a high-resolution PNG, and I have the right title name for this blog post.\r\nHere is the map that I made changes to on Adobe Illustrator:\r\n\r\nReflect on Your Design\r\nMy map uses a sequential color scheme with a color scale that goes from light to dark, which is very effective for showing data that has a natural order for the afterschool meal program counts. The lighter shades (yellow, light green) indicate counties with fewer afterschool meal program sites, while the darker shades (green, dark green) indicate counties with more afterschool meal sites. I realized from the previous map that some cultures may not view the map scale the same way I would. Others might think orange means good and blue means bad. What makes the warmest color (yellow) on this map better than the other one (orange) is that it indicates rather than a county with a warmer color being bad, the warmer color just means that the county needs improvement. Additionally, my new map’s background has more light compared to the last one that was dark. I can see the blue color of the ocean and the gulf better, and the white color is very appropriate for showing the land, whereas the black/dark grey is contrasting the view of the land.\r\nThere were many vector elements that I added to this map. I have a compass symbol that represents my map’s position and orientation very well. I have a legend that I added below the compass to explain the color gradient used on the map. I have a large title to the left of the map that clearly states the map’s purpose, and it has a font style that is approachable and readable. The sushi icon is very nice on this map because the theme of this map is connected to meal programs. Finally, I added the names of the Florida counties each with their own number of program sites because I knew that most geographic maps would need text labels.\r\nGestalt principles really helped me guide my layout and grouping. Gestalt’s principle of Proximity really connects to this map, as the map’s layout uses proximity to group elements that are in common with each other. The title, compass, and legend are all placed near the main map of Florida, which means they are all a part of the same visual. Another principle that connects to this map is Figure/Ground. The map uses this principle to distinguish the important data from the background. The state of Florida is the figure, and it is layered against a white ground.\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4317-Visual-Analytics-Blog/blob/main/_posts/2025-09-08-module-3-assignment/mod3.png?raw=true",
    "last_modified": "2025-09-19T11:59:56-04:00",
    "input_file": "module-3-assignment.knit.md"
  },
  {
    "path": "posts/2025-09-01-module-2-assignment/",
    "title": "Module 2 Assignment",
    "description": "My Geographic Map of Florida Afterschool Meal Program Sites by County",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2025-09-01",
    "categories": [],
    "contents": "\r\nFind a dataset with Addresses.\r\nFor this week’s assignment, I went to Google Dataset Search to find a dataset that I can create a geographic map visualization from using the Tableau Public Desktop Application. I entered these keywords into the search bar: “Florida food access location addresses.” The keywords interested me because access to food is a significant issue in the state of Florida. I found the following dataset to be very complete and accurate, and it included a column with full addresses:\r\nhttps://hub.arcgis.com/datasets/c0c7a78df6a7468f81ff705e5bbcf8dc_0/explore?location=27.763960%2C-83.741355%2C7.12\r\nI plan to use this data to create a visualization that shows which counties in Florida are doing a good job of providing access to food and which counties need improvement.\r\nSave to Google Drive\r\nNext, I had to download the .csv file, save it to my Google Drive, and then open it in Google Sheets.\r\nhttps://docs.google.com/spreadsheets/d/1VibZa5VExkB_CepFfdOKi2qTl939d6ARQ9gqqLZNLmc/edit?usp=sharing\r\n3 & 4. Install Tableau Public, Connect Data in Tableau\r\nI downloaded and installed Tableau Public, and linked it to my Google Drive.\r\n5 & 6. Build the Geographic Map, Export Map Image as .png file\r\nI used the dataset columns that Tableau recognized as geographic data types, such as county and zipcode to create a geovisualization that outlines the counties border lines and I was able to map a count variable to each county and label them accordingly. This allowed me to visualize which counties in Florida are doing a good job of providing access to food and which counties need improvement.\r\nHere is the map:\r\n\r\nPublish to the Blog\r\nI was able to create a new blog post with the image, and provide a link to my data source in Google Sheets.\r\nThere were some challenges that I faced. The first challenge was finding a dataset that had the right number of rows and columns. I needed a dataset that would not be too short on data nor have too much data. I solved this challenge by evaluating the record count when I enter the dataset and try to get enough results from the keywords that I typed. Another challenge that I faced was being able to choose which table names I wanted as my color and detail marks. Some table names convey visualized meaning out of the map while others might make the map appear strange. The solution to this was thinking about which variables I wanted to be illustrated, such as the afterschool count and the county site count.\r\nReflect on Visual Grammar\r\nThere are many additional graphic elements or Gestalt principles that I applied to improve clarity and insight:\r\nPoint size and color scales are helpful because they can help me to visually represent data attributes. In my map, I used warm colors such as brown and orange to indicate a bad value for a county and represent less Florida afterschool meal program sites, whereas the cool colors such as light blue and dark blue are used to indicate a good value for a county and represents a lot of Florida afterschool meal program sites. Rather than using little points to mark certain locations, I used a filled map that would replace little points with larger filled-in color coded counties and their boundaries to make it easier to outline the space that has more or less of Florida afterschool meal program sites.\r\nAdding text labels and tool tips are very helpful because they can help reveal details on every space of data and provide contextual information. Whether it is explaining what symbols mean or providing more specific data, these features can help improve any map that is created. I gave my counties labels so that the audience would know where the data for each county would be located and a numeric value for the number of programs. The labels are easy to read with a font color of white because the background color of my map is “dark.”\r\nProximity and similarity group patterns are helpful Gestalt principles for creating effective maps by arranging information into groups that are easy to understand and interpret. It can help reduce clutter, make the message of the map more clear, and make for more interesting results. The patterns show the counties that are doing a good job being close to larger cities and the pattern of counties that need more improvement appear to be in less populated rural areas.\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4317-Visual-Analytics-Blog/blob/main/_posts/2025-09-01-module-2-assignment/Sheet1resized.png?raw=true",
    "last_modified": "2025-09-01T17:46:11-04:00",
    "input_file": "module-2-assignment.knit.md"
  },
  {
    "path": "posts/2025-08-25-module-1-assignment-1/",
    "title": "Module 1 Assignment 1",
    "description": "Blog Setup & Data Visualization Analysis",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2025-08-25",
    "categories": [],
    "contents": "\r\nSet Up Your Course Blog\r\nWelcome to my first blog. In this post, I started by setting up my LIS4317 course blog.\r\nhttps://lis4317-visual-analytics-blog.netlify.app/\r\nFirst Blog Post: Select & Analyze a Visualization\r\nHere is a visualization of a global population addressing global drought risks using index score legends to indicate the level of risk.\r\n\r\nFleck, A. (2025). Mapping Global Drought Risk [Image]. Statista. https://www.statista.com/chart/25101/countries-by-drought-risk/\r\nAccording to the data visualization, I believe that it was created by a human designer and not generated by AI. My reasoning behind this is that in the website source, there is an author name, along with a publishing date, author email, website name, and a source name in the image, which are attributes that belong to a human designer. I also recognize that the decimal scales for each level of the drought risk are specific and that there could still be some bias found. The only ways this visualization could be created by AI was if the human designer tried to use some guided information from the AI to structure the image properly or if they had an AI reference link.\r\nReadings\r\nI have successfully visited the required chapters to read that were listed in this assignment.\r\nSyllabus Review\r\nAfter thoroughly reviewing the syllabus, I confirm that I understand all crucial information specified on it, especially the course structure, grading, and peer- review process. When I read the course description, I started to look forward to use certain platforms that we’ll focus on in this class, such as Tableu, Plotly, Google Sheets, open-source R, and Python. I also got to have a really close look at the course topics, and I found it interesting that most of the topics listed have a connection to statistics. I also fully understand the grading breakdown, policies, and student learning outcomes.\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4317-Visual-Analytics-Blog/blob/main/_posts/2025-08-25-module-1-assignment-1/M1A1_Visualization.png?raw=true",
    "last_modified": "2025-08-25T13:15:13-04:00",
    "input_file": {}
  }
]
