[
  {
    "path": "posts/2025-08-25-module-1-assignment-1/",
    "title": "Module 1 Assignment 1",
    "description": "Blog Setup & Data Visualization Analysis",
    "author": [
      {
        "name": "Skylar Walsh",
        "url": {}
      }
    ],
    "date": "2025-08-25",
    "categories": [],
    "contents": "\r\nSet Up Your Course Blog\r\nWelcome to my first blog. In this post, I started by setting up my LIS4317\r\ncourse blog.\r\nFirst Blog Post: Select & Analyze a Visualization\r\nHere is a visualization of a global population addressing global drought risks\r\nusing index score legends to indicate the level of risk.\r\n\r\nFleck, A. (2025). Mapping Global Drought Risk [Image]. Statista. https://www.statista.com/chart/25101/countries-by-drought-risk/\r\nAccording to the data visualization, I believe that it was created by a human\r\ndesigner and not generated by AI. My reasoning behind this is that in the\r\nwebsite source, there is an author name, along with a publishing date, author\r\nemail, website name, and a source name in the image, which are attributes that\r\nbelong to a human designer. I also recognize that the decimal scales for each\r\nlevel of the drought risk are specific and that there could still be some bias\r\nfound. The only ways this visualization could be created by AI was if the human\r\ndesigner tried to use some guided information from the AI to structure the image\r\nproperly or if they had an AI reference link.\r\nReadings\r\nI have successfully visited the required chapters to read that were listed in\r\nthis assignment.\r\nSyllabus Review\r\nAfter thoroughly reviewing the syllabus, I confirm that I understand all crucial\r\ninformation specified on it, especially the course structure, grading, and peer-\r\nreview process. When I read the course description, I started to look forward to\r\nuse certain platforms that we’ll focus on in this class, such as Tableu, Plotly,\r\nGoogle Sheets, open-source R, and Python. I also got to have a really close look\r\nat the course topics, and I found it interesting that most of the topics listed\r\nhave a connection to statistics. I also fully understand the grading breakdown,\r\npolicies, and student learning outcomes.\r\n\r\n\r\n\r\n",
    "preview": "https://github.com/skywalshUSF/LIS4317-Visual-Analytics-Blog/blob/main/_posts/2025-08-25-module-1-assignment-1/M1A1_Visualization.png?raw=true",
    "last_modified": "2025-08-25T13:09:36-04:00",
    "input_file": "module-1-assignment-1.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to LIS4317 Visual Analytics Blog",
    "description": "Welcome to our new blog, LIS4317 Visual Analytics Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2025-08-25",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2025-08-25T11:13:37-04:00",
    "input_file": {}
  }
]
